{
    "list": [
        {
            "title": "Reacher",
            "durata": "8 Episodes",
            "year": "2022",
            "description": "Jack Reacher, a veteran military police investigator who has just recently entered civilian life. Reacher is a drifter, carrying no phone and the barest of essentials as he travels the country and explores the nation he once served. When Reacher arrives in the small town of Margrave, Georgia, he finds a community grappling with its first homicide in 20 years. The cops immediately arrest him and eyewitnesses claim to place Reacher at the scene of the crime. While he works to prove his innocence, a deep-seated conspiracy begins to emerge, one that will require Reacher's keen mind and hard-hitting fists to deal with. One thing above all is for sure: They picked the wrong guy to take the fall....",
            "categories": ["adventure", "top-rated"],
            "cast": " Alan Ritchson, Maria Sten, Malcolm Goodwin, Willa Fitzgerald, Chris Webster, Bruce McGill.",
            "language": "english, german, italian, spanish, french",
            "id" : 2,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/hBCFd1LCFdM?si=sSgvwXdYUuxjfL6y",
            "imageHd":"/vuejs-movies-example/img/reacher2.jpg",
            "image": "/vuejs-movies-example/img/reacher1.jpg"
        },
        {
            "title": "The Witcher",
            "durata": "3 Seasons",
            "year": "2019 - 2021 - 2023",
            "description": "Based on the best-selling fantasy series, The Witcher is an epic tale of fate and family. Geralt of Rivia, a solitary monster hunter, struggles to find his place in a world where people often prove more wicked than beasts. But when destiny hurtles him toward a powerful sorceress, and a young princess with a dangerous secret, the three must learn to navigate the increasingly volatile Continent together...",
            "categories": ["adventure", "top-rated"],
            "cast": " Henry Cavill, Freya Allan, Anya Chalotra, Mimi Ndiweni, Eamon Farren, MyAnna Buring, Joey Batey, Wilson Radjou-Pujalte.",
            "language": "english, german, italian, spanish, french",
            "id" : 3,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/ndl1W4ltcmg?si=UUJhnHGO17bifEuO",
            "imageHd":"/vuejs-movies-example/img/the-witcher2.jpg",
            "image": "/vuejs-movies-example/img/the-witcher1.jpg"
        },
        {
            "title": "The Lord of the Rings: The Rings of Power",
            "durata": "8 Episodes",
            "year": "2022",
            "description": "Set thousands of years before the events of The Lord of the Rings, this epic drama follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth...",
            "categories": ["adventure", "top-rated"],
            "cast": " Morfydd Clark, Ismael Cruz Córdova, Charlie Vickers, Cynthia Addai Robinson, Markella Kavenagh, Daniel Weyman, Nazanin Boniadi, Robert Aramayo.",
            "language": "english, german, italian, spanish, french",
            "id" : 4,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/bLirO_Vq7Xo?si=TXdDZdgC-42jy12M",
            "imageHd":"/vuejs-movies-example/img/the-lord-of-the-rings2.jpg",
            "image": "/vuejs-movies-example/img/lord-of-the-rings1.jpg"
        },
        {
            "title": "House of the Dragon",
            "durata": "2 Seasons",
            "year": "2022",
            "description": "Set 200 years before the events of Game of Thrones, House of the Dragon tells the history of House Targaryen as they fight through a civil war...",
            "categories": ["adventure", "top-rated"],
            "cast": "Matt Smith, Rhys Ifans, Fabien Frankel, Milly Alcock, Emma D'Arcy, Olivia Cooke, Graham McTavish, Paddy Considine, Eve Best, Steve Toussaint.",
            "language": "english, german, italian, spanish, french",
            "id" : 1,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/DotnJ7tTA34?si=c_n8goHeXA44D2DY",
            "imageHd":"/vuejs-movies-example/img/house-of-the-dragon2.jpg",
            "image":"/vuejs-movies-example/img/house-of-the-dragon1.jpg"
        },
        {
            "title": "Monarch: Legacy of Monsters",
            "durata": "10 Episodes",
            "year": "2023",
            "description": "After surviving Godzilla's attack on San Francisco, Cate is shaken yet again by a shocking secret. Amid monstrous threats, she embarks on a globetrotting adventure to learn the truth about her family—and the mysterious organization known as Monarch...",
            "categories": ["adventure"],
            "cast": " Wyatt Russell, Kurt Russell, Anna Sawai, Ren Watabe, Kiersey Clemons, Joe Tippett, Elisa Lasowski, Anders Holm, Mari Yamamoto.",
            "language": "english, german, italian, spanish, french",
            "id" : 5,
            "prefer": true,
            "trailerPath":"https://www.youtube.com/embed/JLHsM4bpfxY?si=hmCM_Sv-vmuruaoF",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/monarch.jpg"
        },
        {
            "title": "Good Omens",
            "durata": "2 Seasons",
            "year": "2019 - 2023",
            "description": "According to The Nice and Accurate Prophecies of Agnes Nutter, Witch (the world's only completely accurate book of prophecies), the world will end on a Saturday. Next Saturday, in fact. Just before dinner. So the armies of Good and Evil are amassing, Atlantis is rising, tempers are flaring. Everything appears to be going according to Divine Plan. Except Aziraphale, a somewhat fussy angel, and Crowley, a fast-living demon--both of whom have lived among Earth's mortals since The Beginning and have grown rather fond of the lifestyle--are not actually looking forward to the coming war. And someone seems to have misplaced the Antichrist...",
            "categories": ["comic", "adventure"],
            "cast": " Michael Sheen, David Tennant, Jon Hamm, Shelley Conn, Anna Maxwell Martin, Doon Mackichan, Gloria Obianyo, Frances McDormand, Siân Brooke, Nina Sosanya, Miranda Richardson.",
            "language": "english, german, italian, spanish, french",
            "id" : 6,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/9GljnUA6Ll0?si=gMIm4B-10nIohmsx",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/good-omens.jpg"
        },
        {
            "title": "New Girl",
            "durata": "7 Seasons",
            "year": "2011 - 2012 - 2013 - 2014 - 2016 - 2018",
            "description": "New Girl is a single-camera ensemble comedy starring Zooey Deschanel as Jess, an offbeat girl who - after a bad breakup - moves in with three single guys and essentially sets a bomb off in their lives...",
            "categories": ["romantic"],
            "cast": " Zooey Deschanel, Jake Johnson, Max Greenfield, Hannah Simone, Lamorne Morris, Damon Wayans Jr., Danielle Rockoff, Rhiannon Rockoff.",
            "language": "english, german, italian, spanish, french",
            "id" : 7,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/N9TtrkQQm4s?si=6f5CM5bRTtZwVSPu",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/new-girl.jpg"
        },
        {
            "title": "Fubar",
            "durata": "8 Episodes",
            "year": "2023",
            "description": "Luke and his daughter Emma have lied to each other for years, both of them not knowing the other is a CIA operative. Once they both learn the truth, they realize they don't actually know anything about each other...",
            "categories": ["comic", "adventure"],
            "cast": " Arnold Schwarzenegger, Monica Barbaro, Fabiana Udenio, Milan Carter, Gabriel Luna, Fortune Feimster, Travis Van Winkle, Jay Baruchel, Barbara Eve Harris, Aparna Brielle, Andy Buckley",
            "language": "english, german, italian, spanish, french",
            "id" : 8,
            "prefer": false,
            "trailerPath": "https://www.youtube.com/embed/aYedxZ6rZHo?si=vU95m4s1uDBICi_0",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/fubar.jpg"
        },
        {
            "title": "Obliterated",
            "durata": "8 Episodes",
            "year": "2023",
            "description": "A special forces team thwarts a deadly plot in Sin City and parties accordingly. But when the real threat emerges, they must sober up to save Las Vegas...",
            "categories": ["comic", "adventure"],
            "cast": " Shelley Hennig, Nick Zano, Terrence Terrell, Paola Lázaro, C. Thomas Howell, Kimi Rutledge, Alyson Gorske, Eugene Kim.",
            "language": "english, german, italian, spanish, french",
            "id" : 9,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/6MNfBHFhnNs?si=mpSC0J-7omRF4vPU",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/obliterated.jpg"
        },
        {
            "title": "Outlander",
            "durata": "7 Seasons",
            "year": "2014 - 2016 - 2017 - 2018 - 2020 - 2022 - 2023 ",
            "description": "Outlander follows the story of Claire Randall, a married combat nurse from 1945 who is mysteriously swept back in time to 1743, where she is immediately thrown into an unknown world where her life is threatened. When she is forced to marry Jamie, a chivalrous and romantic young Scottish warrior, a passionate affair is ignited that tears Claire's heart between two vastly different men in two irreconcilable lives. The Outlander series, adapted from Diana Gabaldon's international best-selling books, spans the genres of romance, science fiction, history and adventure into one epic tale...",
            "categories": ["romantic", "adventure"],
            "cast": " Caitríona Balfe, Sam Heughan, Richard Rankin, Sophie Skelton, Duncan Lacroix, César Domboy, John Bell, Lauren Lyle, Caitlin O'Ryan, Grant O'Rourke.",
            "language": "english, german, italian, spanish, french",
            "id" : 10,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/gxurD9SYbog?si=F1Nd70hD0MYp5GXc",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/outlander.jpg"
        },
        {
            "title": "Extended Family",
            "durata": "3 Episodes",
            "year": "2023/2024",
            "description": " After an amicable divorce, Jim and Julia decide to continue to raise their kids at the family home while taking turns on who gets to stay with them. Navigating the waters of divorce and child-sharing gets more complicated for Jim when Trey, the owner of his favorite sports team, enters the picture and wins Julia's heart...",
            "categories": ["comic"],
            "cast": "  Abigail Spencer, Finn Sweeney, Jon Cryer, Sofia Capanna, Donald Faison.",
            "language": "english, german, italian, spanish, french",
            "id" : 11,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/_izb2iLSEyU?si=VG-WuBYbjCilAB4s",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/extended-family.jpg"
        },
        {
            "title": "Space Force",
            "durata": "2 Seasons",
            "year": "2020 - 2022",
            "description": " A workplace comedy centered around the people tasked with creating a sixth branch of the armed services — Space Force...",
            "categories": ["comic", "adventure"],
            "cast": "  John Malkovich, Ben Schwartz, Diana Silvers, Tawny Newsome, Steve Carell, Jimmy O. Yang, Don Lake.",
            "language": "english, german, italian, spanish, french",
            "id" : 11,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/MfdchlFsiIs?si=SiDeNdxAPAqquryj",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/space-force.jpg"
        },
        {
            "title": "The Lovers",
            "durata": "6 Episodes",
            "year": "2023",
            "description": "The Lovers follows Janet, a foul-mouthed, hilarious, Belfast supermarket worker who couldn't give a shit about anything much at all, including her life, and Seamus, a handsome, self-centred, political broadcaster with what looks to be a perfect London life and a celebrity girlfriend. So when Seamus unexpectedly drops into Janet's world (literally over the wall and into her backyard) they instantly clash – and yet also find themselves inextricably drawn to each other...",
            "categories": ["romantic"],
            "cast": " Johnny Flynn, Roisin Gallagher, Alice Eve, Evelyn Miller, Conleth Hill, Simon Paisley Day, Jenn Murray, Sunetra Sarker.",
            "language": "english, german, italian, spanish, french",
            "id" : 12,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/hBbDFN5EkmU?si=6_rv80rxP1sdbRSM",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/the-lovers.jpg"
        },
        {
            "title": "Cannes Confidential",
            "durata": "6 Episodes",
            "year": "2023",
            "description": "Gutsy French detective Camille Delmasse loves her job and her family fiercely. After her father, the former police chief, is accused of corruption, Camille is determined to clear his name. She coerces help from suave con man Harry King, who's in Cannes on a secret quest of his own. Can the sparring duo work together to uncover a conspiracy?",
            "categories": ["romantic"],
            "cast": " Lucie Lucas, Jamie Bamber, Shy'm, Jean-Hugues Anglade, Gerald McRaney.",
            "language": "english, german, italian, spanish, french",
            "id" : 13,
            "prefer": false,
            "trailerPath":"https://www.youtube.com/embed/qFOZG42SGMQ?si=XvPQQIy4DOrcOl6b",
            "imageHd":"",
            "image": "/vuejs-movies-example/img/cannes.jpg"
        }
        
    ]
}